
#include "list.h"
#include "FreeRTOS.h"

// 全局变量
uint8_t flag1 = 0;
uint8_t flag2 = 0;

//*****************************************************************************/
//*函数名 :void delay ( uint32_t count )
//*说明   :延时函数
//*参数   :count for循环次数
//*返回值 :无
//*作者   :
//*****************************************************************************/
void delay ( uint32_t count )
{
    for(; count != 0; count-- );
}

//*****************************************************************************/
//*函数名 :void Task1_Entry( void *p_arg )
//*说明   :任务1
//*参数   :*p_arg 任务参数
//*返回值 :无
//*作者   :
//*****************************************************************************/
void Task1_Entry( void *p_arg )
{
    while(1)
    {
        flag1 = 1;
        delay( 100 );
        flag1 = 0;
        delay( 100 );
    }
}

//*****************************************************************************/
//*函数名 :
//*说明   :
//*参数   :
//*返回值 :
//*作者   :
//*****************************************************************************/
void Task2_Entry( void *p_arg )
{
    while(1)
    {
        flag2 = 1;
        delay( 100 );
        flag2 = 0;
        delay( 100 );
    }
}

// 定义任务块
TCB_T Task1TCB;
TCB_T Task2TCB;


int main(void)
{
    
    while(1)
    {
        
    }
}

